#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_Player_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PopOutStates_structs.hpp"
#include "Athena_Player_SneakySnowmanV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Player_CoolCarpet.Athena_Player_CoolCarpet_C
// 0x0100 (0x0B90 - 0x0A90)
class AAthena_Player_CoolCarpet_C final : public AAthena_Player_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Player_CoolCarpet_C;         // 0x0A90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ShrinkBox_Rotation_B702562648A4C4CB590675BD0D3E005C; // 0x0AB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShrinkBox_Shrinkage_B702562648A4C4CB590675BD0D3E005C; // 0x0AB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ShrinkBox__Direction_B702562648A4C4CB590675BD0D3E005C; // 0x0AB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB9[0x7];                                      // 0x0AB9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     ShrinkBox;                                         // 0x0AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grow_Box_Growth_53FD69EF4E6B5DECD0D74DBB0BDDAA26;  // 0x0AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Grow_Box__Direction_53FD69EF4E6B5DECD0D74DBB0BDDAA26; // 0x0ACC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACD[0x3];                                      // 0x0ACD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Grow_Box;                                          // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Rotation_A659A2B4463C7B7008A67988DEB011BE; // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A659A2B4463C7B7008A67988DEB011BE; // 0x0ADC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ADD[0x3];                                      // 0x0ADD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyJumpedOut;                                  // 0x0AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE9[0x7];                                      // 0x0AE9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class AAthena_Fake_CoolCarpet_C*              CastedFakeActor;                                   // 0x0AF0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MovementEventsBound;                               // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x7];                                      // 0x0AF9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             OnFootstepSound;                                   // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnLandedSound;                                     // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnJumpedSound;                                     // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HolsterId;                                         // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatInt;                                            // 0x0B20(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B24[0x4];                                      // 0x0B24(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         PopOutOnWindUp;                                    // 0x0B28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         AllowPopOut;                                       // 0x0B48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Swimming_0;                                        // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPopOutStates                                 PopState;                                          // 0x0B69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlapsClosed;                                       // 0x0B6A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6B[0x5];                                      // 0x0B6B(0x0005)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           WindUpEndTimer;                                    // 0x0B70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PoppedFromWindUp;                                  // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DidWindUp;                                         // 0x0B79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PoppedFromStand;                                   // 0x0B7A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Firing;                                            // 0x0B7B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FirePressed;                                       // 0x0B7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7D[0x3];                                      // 0x0B7D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           StopFiringTimer;                                   // 0x0B80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Player_CoolCarpet(int32 EntryPoint);
	void StopFiring();
	void FireReleased_Client(class AFortWeapon* Weapon);
	void FirePressed_Client(class AFortWeapon* Weapon);
	void OpenFlaps_Multicast();
	void SetPopState_Multicast(EPopOutStates PopState_0);
	void Cleanup(class AActor* DestroyedActor);
	void OwningClient_ADS();
	void WeaponChangeClient();
	void Server_BlockPopOut();
	void ChangePopState(EPopOutStates PopState_0);
	void OnPopStateChanged(EPopOutStates PopState_0);
	void SetPopState_Server(EPopOutStates PopState_0);
	void SetMatInt(class AActor* Prop);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Unbind_from_Movement_Events();
	void Bind_to_Movement_Events();
	void Set_Flaps_Visible_Multicast();
	void JumpedOut();
	void CustomEvent(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void ADS_Client(bool AimDownsights);
	void CloseFlaps();
	void OpenFlaps();
	void Grow_Box__UpdateFunc();
	void Grow_Box__FinishedFunc();
	void ShrinkBox__UpdateFunc();
	void ShrinkBox__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void OnPlayerFootstep();
	void MovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void Wobble(float Strength, bool MoveUpAndDown);
	void JustAttached();
	void OnPlayerLanded(const struct FHitResult& Hit);
	void OnPlayerMovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnRep_MatInt();
	void OnRep_PopState();
	void OnGaveSneakySnowman();
	void ReceiveBeginPlay();
	void OnWeaponChange();
	void OnStartedMaintaining();
	void OnEndedMaintaining();
	void GetMaterialInt(int32* MatInt_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Player_CoolCarpet_C">();
	}
	static class AAthena_Player_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Player_CoolCarpet_C>();
	}
};

}

