#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Shotgun_Charge_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Shotgun_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C
// 0x0028 (0x1258 - 0x1230)
class AB_Shotgun_Charge_Athena_C final : public AB_Shotgun_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Shotgun_Charge_Athena_C;          // 0x1230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PartialCharged_MF;                               // 0x1238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FullyCharged_MF;                                 // 0x1240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeState;                                       // 0x1248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MaxChargeForSwap;                                  // 0x124C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124D[0x3];                                     // 0x124D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class USoundBase*                             MaxChargeSwapAudio;                                // 0x1250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Shotgun_Charge_Athena(int32 EntryPoint);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnEndCharge();
	void OnReachedMaxCharge();
	void OnStartCharge();
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Shotgun_Charge_Athena_C">();
	}
	static class AB_Shotgun_Charge_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_Charge_Athena_C>();
	}
};

}

