#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: CBGA_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CBGA_Parent.CBGA_Parent_C
// 0x0138 (0x0950 - 0x0818)
class ACBGA_Parent_C : public ABuildingGameplayActorConsumable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ReplicatedCanInteract;                             // 0x0828(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         Row_FirstInteractSpeed;                            // 0x0830(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_SecondInteractSpeed;                           // 0x0850(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FirstInteractText;                                 // 0x0870(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SecondInteractText;                                // 0x0888(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_GatherEnabled;                                 // 0x08A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   GatheredLootTier;                                  // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRollForSwap;                                 // 0x08C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         Row_SwapChance;                                    // 0x08D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SwapActor;                                         // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             SwapActorSpawnOffset;                              // 0x0900(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FScalableFloat                         Row_Enabled;                                       // 0x0930(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CBGA_Parent(int32 EntryPoint);
	void CheckEnabled();
	void RollForSwap();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void ReceiveBeginPlay();
	void OnReady_20953428413833809C18FBAEA984C70A(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void SetDrawDistance();

	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	bool BlueprintGetInteractionTime(const class AFortPawn* InteractingPawn, float* OutInteractionTime, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CBGA_Parent_C">();
	}
	static class ACBGA_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBGA_Parent_C>();
	}
};

}

