#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ColorPicker

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ColorPicker.ColorPicker_C.ExecuteUbergraph_ColorPicker
// 0x0018 (0x0018 - 0x0000)
struct ColorPicker_C_ExecuteUbergraph_ColorPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSwatch;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EColorPickerType                              K2Node_Event_InColorPickerType;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EColorPickerType                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ColorPicker.ColorPicker_C.BP_OnSwapColorPickerType
// 0x0001 (0x0001 - 0x0000)
struct ColorPicker_C_BP_OnSwapColorPickerType final
{
public:
	bool                                          bToSwatch;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ColorPicker.ColorPicker_C.OnSetupColorPicker
// 0x0001 (0x0001 - 0x0000)
struct ColorPicker_C_OnSetupColorPicker final
{
public:
	EColorPickerType                              InColorPickerType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

