#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: DonutChallengeListEntry_Header

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DonutChallengeListEntry_Header.DonutChallengeListEntry_Header_C.ExecuteUbergraph_DonutChallengeListEntry_Header
// 0x0070 (0x0070 - 0x0000)
struct DonutChallengeListEntry_Header_C_ExecuteUbergraph_DonutChallengeListEntry_Header final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InWeek;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
};

// Function DonutChallengeListEntry_Header.DonutChallengeListEntry_Header_C.BPUpdateTitle
// 0x0004 (0x0004 - 0x0000)
struct DonutChallengeListEntry_Header_C_BPUpdateTitle final
{
public:
	int32                                         InWeek;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

