#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_Ocean_Rider_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Ocean_Rider_AnimBP.F_MED_Ocean_Rider_AnimBP_C
// 0x3A90 (0x3EB0 - 0x0420)
class UF_MED_Ocean_Rider_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_7;                         // 0x05A0(0x0580)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B40(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_6;                         // 0x0B60(0x0580)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_5;                         // 0x10E0(0x0580)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_4;                         // 0x1660(0x0580)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x1BE0(0x0580)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_10;                       // 0x2160(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x2268(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x2370(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x2478(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x2580(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x2688(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x2790(0x0580)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2D10(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2E18(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x2F20(0x0108)()
	uint8                                         Pad_3028[0x8];                                     // 0x3028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x3030(0x0580)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x35B0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x36B8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x37C0(0x0108)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x38C8(0x0058)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x3920(0x0580)()
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x3EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         head_rot;                                          // 0x3EA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         left_arm_down;                                     // 0x3EAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_Ocean_Rider_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Ocean_Rider_AnimBP_C">();
	}
	static class UF_MED_Ocean_Rider_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Ocean_Rider_AnimBP_C>();
	}
};

}

