#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_Ice_Maiden_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Ice_Maiden_AnimBP.F_MED_Ice_Maiden_AnimBP_C
// 0x2380 (0x27A0 - 0x0420)
class UF_MED_Ice_Maiden_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x0428(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x0530(0x0108)()
	uint8                                         Pad_638[0x8];                                      // 0x0638(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x0640(0x0580)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x0BC0(0x0580)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x1140(0x0580)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x16C0(0x0580)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1C40(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x1D48(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x1E50(0x0108)()
	uint8                                         Pad_1F58[0x8];                                     // 0x1F58(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x1F60(0x01B0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2110(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2218(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2238(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x2258(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2398(0x0030)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x23C8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x24D0(0x0108)()
	uint8                                         Pad_25D8[0x8];                                     // 0x25D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x25E0(0x01B0)()
	float                                         crouching_alpha;                                   // 0x2790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isMoving;                                          // 0x2794(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_F_MED_Ice_Maiden_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Ice_Maiden_AnimBP_C">();
	}
	static class UF_MED_Ice_Maiden_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Ice_Maiden_AnimBP_C>();
	}
};

}

