#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FloppingRabbitLayerAnimBP

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C
// 0x19B0 (0x1CE0 - 0x0330)
class UFloppingRabbitLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0338(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0368(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x03E0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0410(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0488(0x0030)()
	float                                         Pitch;                                             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x04C8(0x0078)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0540(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x05B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x05E8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0660(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0690(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0708(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x07A8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0820(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0850(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x08C8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0968(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x09E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0A10(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0A88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0B28(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0BA0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0BD0(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0C48(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0CE8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0D60(0x0030)()
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0D90(0x0240)(NoDestructor)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0FD0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x1048(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x1078(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x10F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1120(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x1198(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x11C8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x11F8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1228(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x1258(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1288(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x12B8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x12E8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1318(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1348(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1378(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x13A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x13D8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1450(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x1480(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x14F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1528(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x15A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x15D0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1648(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1678(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x16F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1720(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1798(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x17C8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1840(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1870(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x18E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1918(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1990(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x19C0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1A38(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1A68(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1AE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1B10(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1B88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1C28(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CA0(0x0030)()
	bool                                          OneHandGrip;                                       // 0x1CD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FloppingRabbitLayerAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam_0, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FloppingRabbitLayerAnimBP_C">();
	}
	static class UFloppingRabbitLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloppingRabbitLayerAnimBP_C>();
	}
};

}

