#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortLayeredAudioComponent_Glider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FortLayeredAudioComponent_Glider.FortLayeredAudioComponent_Glider_C
// 0x0030 (0x0830 - 0x0800)
class UFortLayeredAudioComponent_Glider_C final : public UFortLayeredAudioComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerParachute*                   OwningParachute;                                   // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugIgnoreFullyDeployed;                          // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           Handle_Fully_Deploy;                               // 0x0818(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Fully_Deployed;                                    // 0x0820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FortLayeredAudioComponent_Glider(int32 EntryPoint);
	void Reset_Parachute_Status();
	void Fully_Deployed_Event();
	void CustomEvent_1();
	void Check_Fully_Deployed();
	void ReceiveBeginPlay();
	void Update_Glider_Audio(float ForwardDot, float RightDot);
	void Check_for_Fully_Deployed(bool* Fully_Deployed_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortLayeredAudioComponent_Glider_C">();
	}
	static class UFortLayeredAudioComponent_Glider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortLayeredAudioComponent_Glider_C>();
	}
};

}

