#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HeldObjectLayerAnimBP

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C
// 0x1B00 (0x1DC0 - 0x02C0)
class UHeldObjectLayerAnimBP_C final : public UFortItemLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x02F8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0370(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x03A0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0418(0x0030)()
	float                                         Pitch;                                             // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimOffsetAlpha;                                    // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0458(0x0078)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x04D0(0x0188)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0658(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x06D0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0788(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x07B0(0x0030)()
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x07E0(0x0240)(NoDestructor)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0A20(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0A98(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0B10(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0BB0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0BE0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0C58(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0C88(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0D00(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0D30(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0D60(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0D90(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0E08(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0E38(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0EB0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0EE0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0F58(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0F88(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x1000(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1030(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x10A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x10D8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x1150(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1180(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x11F8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x1228(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x1258(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x1288(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x1300(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x1330(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x13A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x13D8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1450(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x1480(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x14F8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1528(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x15A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x15D0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x1648(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1678(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x16F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1720(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1798(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x17C8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1840(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1870(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x18E8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1918(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1990(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x19C0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1A38(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1A68(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1AE0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1B10(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1B88(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1BB8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1C30(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1C60(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1CD8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1D08(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1D80(0x0030)()
	bool                                          IsHeldObjectDropped;                               // 0x1DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeldObjectLayerAnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimNotify_HeldObjectPickUp();
	void AnimNotify_HeldObjectPlace();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeldObjectLayerAnimBP_AnimGraphNode_RotationOffsetBlendSpace_C2A887E04220180AB9CD6384FDB74E4E();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam_0, struct FPoseLink* ItemUpperBody_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha_0, float Yaw_0, float Pitch_0, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeldObjectLayerAnimBP_C">();
	}
	static class UHeldObjectLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeldObjectLayerAnimBP_C>();
	}
};

}

