#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LiveStreamAnimation

#include "Basic.hpp"


namespace SDK
{

// Enum LiveStreamAnimation.ELiveStreamAnimationRole
// NumValues: 0x0004
enum class ELiveStreamAnimationRole : uint8
{
	Proxy                                    = 0,
	Processor                                = 1,
	Tracker                                  = 2,
	ELiveStreamAnimationRole_MAX             = 3,
};

// ScriptStruct LiveStreamAnimation.LiveStreamAnimationHandle
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FLiveStreamAnimationHandle final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct LiveStreamAnimation.LiveStreamAnimationLiveLinkSourceOptions
// 0x0001 (0x0001 - 0x0000)
struct FLiveStreamAnimationLiveLinkSourceOptions final
{
public:
	uint8                                         bWithSceneTime : 1;                                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWithStringMetaData : 1;                           // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWithPropertyValues : 1;                           // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWithTransformTranslation : 1;                     // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWithTransformRotation : 1;                        // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWithTransformScale : 1;                           // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};

}

