#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: M_LRG_Professor_Pup_AnimBP

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_LRG_Professor_Pup_AnimBP.M_LRG_Professor_Pup_AnimBP_C
// 0x37B0 (0x3C00 - 0x0450)
class UM_LRG_Professor_Pup_AnimBP_C final : public UCustomCharacterPartAnimInstance_ProfPupBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0488(0x0140)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x05C8(0x0020)()
	uint8                                         Pad_5E8[0x8];                                      // 0x05E8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x05F0(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0A30(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0A50(0x0108)()
	uint8                                         Pad_B58[0x8];                                      // 0x0B58(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0B60(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0FA0(0x0440)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x13E0(0x0128)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x1508(0x0360)()
	float                                         __CustomProperty_CurrentLOD_float_ACCD6BD94642F97285D1E7BD9E5B9CCA; // 0x1868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_186C[0x4];                                     // 0x186C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x1870(0x0360)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x1BD0(0x0128)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1CF8(0x0360)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2058(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2078(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2180(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2288(0x0020)()
	uint8                                         Pad_22A8[0x8];                                     // 0x22A8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x22B0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x26F0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2B30(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2F70(0x0440)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x33B0(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x3478(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3498(0x00B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x3550(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3570(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3598(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x35B8(0x0078)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3630(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3738(0x0108)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x3840(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3888(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x38A8(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3948(0x00A0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x39E8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3A30(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3AF0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3BA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3BD0(0x0028)()

public:
	void ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP_AnimGraphNode_SequenceEvaluator_0DCA9A3B4C6F9A8333928A9F46C04FBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP_AnimGraphNode_BlendListByBool_C3C73B0C4F95013F94FB3487B3D3081B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP_AnimGraphNode_ControlRig_ACCD6BD94642F97285D1E7BD9E5B9CCA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP_AnimGraphNode_ApplyAdditive_F72559104F94D2EA7DE428B3ACD43B1B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP_AnimGraphNode_ModifyBone_3BB0975649AA515A449325A0C91E0570();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_LRG_Professor_Pup_AnimBP_AnimGraphNode_ModifyBone_B01AAA4B46F1CAE5AF5C45B44737B0E5();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_LRG_Professor_Pup_AnimBP_C">();
	}
	static class UM_LRG_Professor_Pup_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_LRG_Professor_Pup_AnimBP_C>();
	}
};

}

