#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PetAnimLayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PetAnimLayerInterface.PetAnimLayerInterface_C.PetFullOverrideLayer
// 0x0020 (0x0020 - 0x0000)
struct PetAnimLayerInterface_C_PetFullOverrideLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PetFullOverrideLayer_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function PetAnimLayerInterface.PetAnimLayerInterface_C.PetLookAtOverrideLayer
// 0x0030 (0x0030 - 0x0000)
struct PetAnimLayerInterface_C_PetLookAtOverrideLayer final
{
public:
	struct FPoseLink                              Pose;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         LookAtOverrideInput;                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtTargetLocationInput;                         // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              PetLookAtOverrideLayer_0;                          // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};

}

