#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prj_Athena_GliderGrappler_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_Hook_Athena_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_GliderGrappler_Parent.Prj_Athena_GliderGrappler_Parent_C
// 0x0078 (0x0B90 - 0x0B18)
class APrj_Athena_GliderGrappler_Parent_C : public AB_Prj_Hook_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_GliderGrappler_Parent_C; // 0x0B18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaGliderItemDefinition*            Glider_Cosmetic_Override;                          // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Deployed;                                      // 0x0B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B29[0x3];                                      // 0x0B29(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         BadgerGrapeDelayFailsafe;                          // 0x0B2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BlockedAbilitiesWhileLaunching;                    // 0x0B30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           BlockBuildingTag;                                  // 0x0B50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_GlideBlockActions;                              // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_GliderOpen;                                  // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_DestroyGrappler;                             // 0x0B68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_BlockingGE;                                      // 0x0B70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Prj_Athena_GliderGrappler_Parent(int32 EntryPoint);
	void Teleported___Return_abilities_and_stop(class AFortPawn* FortPawn);
	void Jump_Apex_Reached();
	void ReceiveDestroyed();
	void Grapple();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_GliderGrappler_Parent_C">();
	}
	static class APrj_Athena_GliderGrappler_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_GliderGrappler_Parent_C>();
	}
};

}

