#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SpatialStyleChallengeUnlockReason

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialStyleChallengeUnlockReason.SpatialStyleChallengeUnlockReason_C
// 0x0080 (0x0300 - 0x0280)
class USpatialStyleChallengeUnlockReason_C final : public UAthenaSpatialStyleChallengeUnlockReason
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortLazyImage*                         Complete;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DoneTag;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Empty;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_MissionProgressCount;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_CompleteCheck;                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            Unlocked_Color;                                    // 0x02B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Locked_Color;                                      // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SpatialStyleChallengeUnlockReason(int32 EntryPoint);
	void UpdateMissionProgressCount(int32 CompletedCount, int32 RequiredCount);
	void ShowBattlepassPurchaseReason(const class FText& InSeason);
	void ShowBattlepassLevelReason(int32 InLevel);
	void OnUnlockReasonUpdated(bool bInUnlocked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialStyleChallengeUnlockReason_C">();
	}
	static class USpatialStyleChallengeUnlockReason_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialStyleChallengeUnlockReason_C>();
	}
};

}

